In [6]:
# 1. How to import pandas and check the version?
import pandas as pd

In [7]:
pd.__version__

'1.0.3'

In [9]:
import numpy as np
np.__version__

'1.19.5'

In [10]:
# 2. How to create a series from a list, numpy array and dict?
"""
Create a pandas series from each of the items below: a list, numpy and a dictionary Input

"""
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [11]:
mylist[0]

'a'

In [12]:
myarr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25])

In [370]:
mydict

{'a': 0,
 'b': 1,
 'c': 2,
 'e': 3,
 'd': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [374]:
# pd.Series()

mylist_series = pd.Series(mylist)
myarr_series = pd.Series(myarr)
mydict_series = pd.Series(mydict)

In [375]:
mylist_series.head(2)

0    a
1    b
dtype: object

In [376]:
myarr_series.head(2)

0    0
1    1
dtype: int64

In [377]:
mydict_series.head(1)

a    0
dtype: int64

In [381]:
pd.DataFrame(mydict_series.index).head(2)

   0
0  a
1  b

In [382]:
# 3. How to convert the index of a series into a column of a dataframe?
"""
Convert the series ser into a dataframe with its index as another column on the dataframe.

"""
ser = pd.Series(mydict)

In [383]:
ser.index

Index(['a', 'b', 'c', 'e', 'd', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n',
       'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'],
      dtype='object')

In [384]:
ser.head(2)

a    0
b    1
dtype: int64

In [385]:
pd.DataFrame(ser).head(2)

   0
a  0
b  1

In [386]:
pd.DataFrame(ser).columns
# ser.columns # AttributeError: 'Series' object has no attribute 'columns'

RangeIndex(start=0, stop=1, step=1)

In [387]:
pd.DataFrame(ser).index

Index(['a', 'b', 'c', 'e', 'd', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n',
       'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'],
      dtype='object')

In [389]:
df = pd.DataFrame(ser)
df_index_as_column = df.reset_index()
df_index_as_column.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

In [391]:
# Solution to_frame()
df_in_co = ser.to_frame().reset_index()
df_in_co.head(2)

  index  0
0     a  0
1     b  1

In [392]:
df1 = ser.to_frame()
df1.head(1)

   0
a  0

In [393]:
type(df1)

pandas.core.frame.DataFrame

In [394]:
df2 = pd.DataFrame(ser)
df2.head(1)columns

   0
a  0

In [395]:
type(df2)

pandas.core.frame.DataFrame

In [396]:
# 4. How to combine many series to form a dataframe?

"""
Combine ser1 and ser2 to form a dataframe. 

"""

ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [397]:
ser1.head(2)

0    a
1    b
dtype: object

In [398]:
ser2.head(2)

0    0
1    1
dtype: int64

In [399]:
# concat
df_s1_s2 = pd.concat([ser1, ser2], axis = 1)
df_s1_s2.head(2)

   0  1
0  a  0
1  b  1

In [400]:
# combine_first
s1.combine_first(s2).reset_index().head(2)

   index  0
0      0  a
1      1  b

In [401]:
ser1.combine_first(ser2).reset_index().head(2)

   index  0
0      0  a
1      1  b

In [402]:
s1 = pd.Series(list('abcd'))
s2 = pd.Series(np.arange(100, 104))

In [403]:
s2

0    100
1    101
2    102
3    103
dtype: int64

In [405]:
pd.concat([s1, s2], axis = 1).head(2)

   0    1
0  a  100
1  b  101

In [407]:
df_1 = pd.DataFrame({'alpha': ser1, 'num': ser2})
df_1.head(2)

  alpha  num
0     a    0
1     b    1

In [408]:
df_1.tail(2)

   alpha  num
24     y   24
25     z   25

In [409]:
# 5. How to assign name to the series’ index?
"""
Give a name to the series ser calling it ‘alphabets'

"""
ser.head(2)

a    0
b    1
dtype: int64

In [410]:
ser.rename("alphabets").head(2)

a    0
b    1
Name: alphabets, dtype: int64

In [417]:
ser.name = 'alphabets'
ser.head(2)

a    0
b    1
Name: alphabets, dtype: int64

In [418]:
# 6 How to get the items of series A not present in series B?
"""
"""
sera = pd.Series([1, 2, 3, 4, 5])
serb = pd.Series([4, 5, 6, 7, 8])

In [419]:
for item in sera:
    print(item)

1
2
3
4
5

In [420]:
sera_not_b = []
for item in sera:
    if item in serb.tolist():
        pass
    else:
        sera_not_b.append(item)
    
pd.Series(sera_not_b)

0    1
1    2
2    3
dtype: int64

In [421]:
# item of a in b
sera[sera.isin(serb)]

3    4
4    5
dtype: int64

In [422]:
# item of a not in b = a - (item of a in b)

sera[~sera.isin(serb)]

0    1
1    2
2    3
dtype: int64

In [423]:
# to get the items of series A not present in series B?

sera[~sera.isin(serb)]

0    1
1    2
2    3
dtype: int64

In [424]:
# 7. How to get the items of series B not present in series A?

serb[~serb.isin(sera)]

2    6
3    7
4    8
dtype: int64

In [427]:
# 8. How to get the items not common to both series A and series B?
sera = pd.Series([1, 2, 3, 4, 5])
serb = pd.Series([4, 5, 6, 7, 8])

ser_a_not_in_b = sera[~sera.isin(serb)] # [1,2,3]
ser_b_not_in_a = serb[~serb.isin(sera)] # [6,7,8]

s = pd.concat([ser_a_not_in_b, ser_b_not_in_a], axis = "rows") # [1,2,3,6,7,8] # # axis = 0
type(s)

pandas.core.series.Series

In [428]:
d = pd.concat([ser_a_not_in_b, ser_b_not_in_a], axis = "columns") # axis = 1
type(d)

pandas.core.frame.DataFrame

In [429]:
# to get the items not common to both series A and series B?

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

# Solution
pd.Series(np.union1d(ser1, ser2))  # union  # 1, 2, 3, 4, 5, 6, 7, 8
pd.Series(np.intersect1d(ser1, ser2))  # intersect # 4,5

# items not common to both A & B
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [432]:
# 9. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
"""
Compute the minimum, 25th percentile, median, 75th, and maximum of ser.
"""
ser = pd.Series(np.random.normal(10, 5, 25))

# random.normal(loc=0.0, scale=1.0, size=None)

ser.head(2)

0    7.508708
1    6.084185
dtype: float64

In [434]:
ser.max() # 100 %ile

17.93252990678331

In [435]:
ser.min() # 0%ile

0.11423886285650653

In [436]:
ser.describe()

count    25.000000
mean      9.430872
std       4.623397
min       0.114239
25%       6.084185
50%       8.561907
75%      13.700200
max      17.932530
dtype: float64

In [438]:
ser.median() # 50%ile

8.561906685250912

In [439]:
# ser.info() AttributeError: 'Series' object has no attribute 'info'

In [442]:
# Compute the minimum(0), 25th percentile, median(50), 75th, and maximum(100) of ser
np.percentile(ser, q=[0, 25, 50, 75, 100])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

In [443]:
np.percentile(ser, [0, 100])

array([ 1.25117263, 18.0949083 ])

In [444]:
# 10 How to get frequency counts of unique items of a series?
"""
Calculte the frequency counts of each unique value ser.
""" 

serA = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
# random.randint(low, high=None, size=None, dtype=int)
serA.head

0    c
1    e
2    d
3    g
4    c
dtype: object

In [450]:
serA.value_counts()

c    6
e    4
d    4
b    4
f    3
h    3
a    3
g    3
dtype: int64

In [451]:
ser_num = pd.Series(np.random.randint(5, size=10))
ser_num.value_counts()

1    3
4    2
2    2
0    2
3    1
dtype: int64

In [479]:
serN =  pd.Series(np.take(list('XYZKLMN'), np.random.randint(7, size = 10)))
serN
serN.value_counts()

L    3
X    2
Y    2
Z    1
K    1
M    1
dtype: int64

In [563]:
# 11. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
"""
From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.
"""
np.random.RandomState(100)

ser = pd.Series(np.random.randint(2, 10, [12]))
# random.randint(low, high=None, size=None, dtype=int)

ser
ser.value_counts()

3    3
5    2
2    2
9    1
8    1
7    1
6    1
4    1
dtype: int64

In [564]:
ser[ser.value_counts().index[:1]] = "topmost"
ser[ser.value_counts().index[1:2]] = "top2nd"
ser

0           3
1           3
2      top2nd
3     topmost
4           7
5           2
6           9
7           5
8           4
9           3
10          2
11          6
dtype: object

In [565]:
ser.value_counts()

3          3
2          2
top2nd     1
9          1
7          1
6          1
5          1
4          1
topmost    1
dtype: int64

In [566]:
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

0         3
1         3
2     Other
3     Other
4     Other
5         2
6     Other
7     Other
8     Other
9         3
10        2
11    Other
dtype: object

In [569]:
# 12. How to bin a numeric series to 10 groups of equal size?

ser = pd.Series(np.random.random(20))
ser

0     0.474060
1     0.448165
2     0.868625
3     0.053092
4     0.341339
5     0.246452
6     0.431895
7     0.627600
8     0.105593
9     0.857261
10    0.047855
11    0.760218
12    0.557584
13    0.540689
14    0.831905
15    0.797014
16    0.891577
17    0.199621
18    0.720492
19    0.490443
dtype: float64

In [573]:
pd.qcut(ser, q=[0, .10, .20, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th'])

0      5th
1      4th
2     10th
3      1st
4      3rd
5      3rd
6      4th
7      7th
8      2nd
9      9th
10     1st
11     8th
12     6th
13     6th
14     9th
15     8th
16    10th
17     2nd
18     7th
19     5th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

In [577]:
pd.qcut(ser, q=[0, .20, .4, .6, .8, 1], 
        labels=['1st', '3rd', '5th', '7th', '9th']).value_counts()

9th    4
7th    4
5th    4
3rd    4
1st    4
dtype: int64

In [581]:
# 12.1. How to convert a numpy array to a dataframe of given shape? (L1)
"""
L1 Reshape the series ser into a dataframe with 7 rows and 5 columns Input
"""
ser = pd.Series(np.random.randint(1, 10, 35))

# random.randint(low, high=None, size=None, dtype=int)

len(ser)

35

In [583]:
# ser.info() # # AttributeError: 'Series' object has no attribute 'info'
ser.describe()

count    35.000000
mean      4.885714
std       2.773524
min       1.000000
25%       3.000000
50%       4.000000
75%       7.000000
max       9.000000
dtype: float64

In [584]:
ser.shape

(35,)

In [594]:
# ser.reshape(7,5)
# # AttributeError: 'Series' object has no attribute 'reshape'

df_ser = pd.DataFrame(ser)
df_ser.shape

(35, 1)

In [596]:
# df_ser.reshape(7,5)
# # AttributeError: 'DataFrame' object has no attribute 'reshape'

In [600]:
np.array(ser).reshape(7,5)

array([[4, 8, 6, 3, 7],
       [5, 1, 4, 7, 9],
       [7, 1, 9, 4, 4],
       [9, 1, 8, 7, 1],
       [3, 4, 6, 3, 6],
       [1, 8, 9, 4, 5],
       [3, 2, 2, 9, 1]])

In [601]:
np_ser = np.array(ser)
np_ser

array([4, 8, 6, 3, 7, 5, 1, 4, 7, 9, 7, 1, 9, 4, 4, 9, 1, 8, 7, 1, 3, 4,
       6, 3, 6, 1, 8, 9, 4, 5, 3, 2, 2, 9, 1])

In [604]:
np_ser.shape

(35,)

In [605]:
np_ser.reshape(7,5)

array([[4, 8, 6, 3, 7],
       [5, 1, 4, 7, 9],
       [7, 1, 9, 4, 4],
       [9, 1, 8, 7, 1],
       [3, 4, 6, 3, 6],
       [1, 8, 9, 4, 5],
       [3, 2, 2, 9, 1]])

In [607]:
# Also
ser.values.reshape(7,5)

array([[4, 8, 6, 3, 7],
       [5, 1, 4, 7, 9],
       [7, 1, 9, 4, 4],
       [9, 1, 8, 7, 1],
       [3, 4, 6, 3, 6],
       [1, 8, 9, 4, 5],
       [3, 2, 2, 9, 1]])

In [609]:
df_reshape = pd.DataFrame(ser.values.reshape(7,5))
df_reshape

   0  1  2  3  4
0  4  8  6  3  7
1  5  1  4  7  9
2  7  1  9  4  4
3  9  1  8  7  1
4  3  4  6  3  6
5  1  8  9  4  5
6  3  2  2  9  1

In [627]:
# # 13. How to find the positions of numbers that are multiples of 3 from a series?
"""
Find the positions of numbers that are multiples of 3 from ser.
""" 
ser_postion = pd.Series(np.random.randint(1, 10, 7))
ser_postion

0    2
1    5
2    1
3    9
4    9
5    4
6    4
dtype: int64

In [614]:
ser_postion.loc[3]

6

In [628]:
np.where(ser_postion % 3==0)

(array([3, 4]),)

In [630]:
np.where(ser % 3==0)

(array([ 2,  3,  9, 12, 15, 20, 22, 23, 24, 27, 30, 33]),)

In [629]:
x = input()
num = list(map(int, x.split()))
l =[]
for i in num:  
    if i%3 != 0:
        l.append(i)
print(*l, sep = " ")

1 2 3 4 5 3  42 4 2 4 2  42 5 3 4 3
1 2 4 5 4 2 4 2 5 4

In [623]:
print(*(item for item in map(int, input().split()) if item % 3))

1 2 3 45 6 7
1 2 7

In [631]:
# 14. How to extract items at given positions from a series
ser_pos = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [633]:
ser_pos.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

In [646]:
ser_pos.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

In [647]:
ser_pos.loc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

In [652]:
# 15. How to stack two series vertically and horizontally ?
ser_num = pd.Series(range(5))
ser_AB = pd.Series(list('abcde'))

In [653]:
# vertically >>  axis = 'columns' ,OR,  axis = 1
pd.concat([ser_num, ser_AB], axis = 'columns')

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [654]:
# horizontally >>  axis = 'rows' ,OR,  axis = 0
pd.concat([ser_num, ser_AB], axis = 'rows')

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [651]:
pd.concat([ser_num, ser_AB])

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [655]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

# Output
# Vertical
ser1.append(ser2)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [656]:
# Horizontal
df = pd.concat([ser1, ser2], axis=1)
df

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [657]:
# 16. How to get the positions of items of series A in another series B?

serA = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
serB = pd.Series([1, 3, 10, 13])

In [663]:
np.union1d(serA,serB)

array([ 1,  3,  5,  6,  8,  9, 10, 12, 13])

In [667]:
np.intersect1d(serA,serB)

array([ 1,  3, 10, 13])

In [670]:
# A in B
serA[serA.isin(serB)]

0    10
4     3
5     1
8    13
dtype: int64

In [674]:
[np.where(i == serA)[0].tolist()[0] for i in serB]

[5, 4, 0, 8]

In [678]:
[pd.Index(serA).get_loc(i) for i in serB]

[5, 4, 0, 8]

In [685]:
# 17. How to compute the mean squared error on a truth and predicted series?
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [694]:
sum((truth-pred)**2)/len(truth)

0.48282765846287523

In [695]:
np.mean((truth-pred)**2)

0.48282765846287523

In [702]:
# 18. How to convert the first character of each element in a series to uppercase?
ser_up = pd.Series(["go", "went", "gone"])
ser_up

0      go
1    went
2    gone
dtype: object

In [707]:
ser_upper = []
for val in ser_up:
    ser_upper.append(val.title())
pd.Series(ser_upper)

0      Go
1    Went
2    Gone
dtype: object

In [708]:
ser = pd.Series(['fruit', 'apple', 'banana', 'orange'])
ser.map(lambda x: x.title())

0     Fruit
1     Apple
2    Banana
3    Orange
dtype: object